tsung/general_user.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="wywb-new-indexing.mui3yzewey.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="30" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="30" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="30" unit="second">
      <users arrivalrate="6" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="30" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="30" unit="second">
      <users arrivalrate="10" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="30" unit="second">
      <users arrivalrate="12" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="30" unit="second">
      <users arrivalrate="14" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="8" duration="30" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="9" duration="30" unit="second">
      <users arrivalrate="18" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="10" duration="30" unit="second">
      <users arrivalrate="20" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="11" duration="30" unit="second">
      <users arrivalrate="22" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="12" duration="30" unit="second">
      <users arrivalrate="24" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="13" duration="30" unit="second">
      <users arrivalrate="26" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <session name="passive_user" probability="50" type="ts_http">

      <setdynvars sourcetype="random_number" start="1" end="10000">
        <var name="num"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="400" end="899">
        <var name="userrand"/>
      </setdynvars>

      <setdynvars sourcetype="random_number" start="15" end="40">
        <var name="thinktimerand"/>
      </setdynvars>

        <!-- Log in with new email -->
        <transaction name="user_login">
          <request subst="true">
            <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
            <http url="/login" method="POST" version="1.1" contents="session[email]=example-%%_userrand%%@railstutorial.org&amp;
             session[password]=password&amp;" content_type="application/x-www-form-urlencoded" />
          </request>
        </transaction>

      <!-- Check the users he is following -->
      <transaction name="user_following">
        <request subst="true">
          <http url="/users/%%_userid%%/following/" method="GET" version="1.1" />
        </request>
      </transaction>

      <!-- Go to the users page -->
      <transaction name="users_page">
        <request subst="true">
          <http url="/users" method="GET" version="1.1" />
        </request>
      </transaction>


      <!-- Go the the user he wants to follow -->
      <transaction name="Random_user_follow">
        <request subst="true">
          <http url="/users/%%_userrand%%" method="GET" version="1.1" />
        </request>
      <!-- Follow the user -->
        <request subst="true">
          <http url="/relationships" method="POST" version="1.1" contents="followed_id=%%_userrand%%&amp;commit=Follow"/>
        </request>
      </transaction>
      <!-- Go to his following page again -->
      <transaction name="user_following_again">
        <request subst="true">
          <http url='/users/%%_userid%%/following/' version='1.1' method='GET'></http>
        </request>
      </transaction>

      <thinktime value="%%_thinktimerand%%" random="false"/>
        <!-- Log out -->
      <transaction name="log_out">
        <request subst="true">
          <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>

    </session>
    
    <session name="active_user" probability="30" type="ts_http">

        <setdynvars sourcetype="random_number" start="1" end="35">
            <var name="filterid"/>
        </setdynvars>

        <setdynvars sourcetype="random_number" start="1" end="99">
            <var name="userrand"/>
        </setdynvars>

        <setdynvars sourcetype="random_number" start="20" end="50">
            <var name="userdelay"/>
        </setdynvars>

        <!--random user login-->
        <transaction name="user_login">
            <request subst="true">
                <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
                <http url="/login" method="POST" version="1.1" contents="session[email]=example-%%_userrand%%@railstutorial.org&amp;
         session[password]=password&amp;" content_type="application/x-www-form-urlencoded" />
            </request>
        </transaction>

        <!--access the events page-->
        <transaction name="access_events">
            <request>
                <http url='/events' version='1.1' method='GET'></http>
            </request>

            <!--use the tag filter-->
            <request subst="true">
                <http url='/events?tag_id=%%_filterid%%' version='1.1' method='GET'></http>
            </request>

            <!--use the location filter-->
            <request subst="true">
                <http url='/events?location_id=%%_filterid%%' version='1.1' method='GET'></http>
            </request>
        </transaction>

        <thinktime value="%%_userdelay%%" random="false"/>

        <!--create comment-->
        <transaction name="add_comment">
            <request subst="true">
                <http url="/comments" method="POST" version="1.1" contents="comment[event_id]=%%_filterid%%&amp;comment[message]=tsung generated comment&amp;
                comment[user_id]=%%_userid%%&amp;comment[date]=Fri Nov 30 2018 22:11:32 GMT-0800 (Pacific Standard Time)" content_type="application/x-www-form-urlencoded" />
            </request>
        </transaction>

        <!--rsvp to event-->
        <transaction name="rsvp_event">
            <request subst="true">
                <http url="/attendees" method="POST" version="1.1" contents="attendee[event_id]=%%_filterid%%&amp;attendee[guests_count]=%%_filterid%%&amp;
                attendee[user_id]=%%_userid%%&amp;attendee[updated_at]=Fri Nov 30 2018 22:11:32 GMT-0800 (Pacific Standard Time)" content_type="application/x-www-form-urlencoded" />
            </request>
        </transaction>

        <!--access the second page of events-->
        <transaction name="access_events_page">
            <request>
                <http url='/events?page=2' version='1.1' method='GET'></http>
            </request>
        </transaction>

        <transaction name="user_logout">
            <request subst="true">
                <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
            </request>
        </transaction>

    </session>
    
    <!--Signup, edit profile and logout-->
     <session name="new_user" probability="10" type="ts_http">

        <setdynvars sourcetype="random_number" start="1" end="10000000">
          <var name="userrand"/>
        </setdynvars>

        <setdynvars sourcetype="random_number" start="15" end="40">
          <var name="thinktimerand"/>
        </setdynvars>

        <!-- Sign up -->

	<transaction name="SIGN_UP">
        <request subst="true">
          <http url="/" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/signup" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
          <http url="/users" method="POST" version="1.1" contents="user[name]=Aprilcomesshewill&amp;user[age]=20&amp;user[city]=Santa Barbara&amp;
          user[email]=testuser_%%_userrand%%@test.com&amp;user[password]=foobar&amp;user[password_confirmation]=foobar&amp;user[home_address]=foobar&amp;commit=Create User"
          content_type="application/x-www-form-urlencoded" />
        </request>

	</transaction>
        <!-- Edit account -->

	<transaction name="EDIT">
        <request subst="true">
          <http url="/users/%%_userid%%/edit" method="GET" version="1.1" />
        </request>

        <request subst="true">
          <http url="/users/%%_userid%%" method="PATCH" version="1.1"
          contents="user[home_address]=San Clemente Villages&amp;user[age]=30&amp;commit=Update User"
          content_type="application/x-www-form-urlencoded" />
        </request>

	</transaction>
        <!-- Log out -->
    <thinktime value="%%_thinktimerand%%" random="false"/>

	<transaction name="LOG_OUT">
        <request subst="true">
          <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
        </request>

	</transaction>

    </session>
    
    <!--Login, create location,tag,event and logout-->
    <session name="event_planner_user" probability="10" type="ts_http">
      
      <setdynvars sourcetype="random_number" start="1" end="10000">
        <var name="num"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="20" end="50">
        <var name="userdelay"/>
      </setdynvars>
      
      <setdynvars sourcetype="random_number" start="1" end="99">
        <var name="userrand"/>
      </setdynvars>
      
     <transaction name="LOGIN">
       <request subst="true">
         <dyn_variable name="userid" re="Location: .*/users/([0-9]+)"></dyn_variable>
          <http url="/login" method="POST" version="1.1" contents="session[email]=example-%%_userrand%%@railstutorial.org&amp;
           session[password]=password&amp;" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
      
      <transaction name="CREATE_LOCATION">
        <request subst="true">
          <dyn_variable name="locationid" re="Location: .*/locations/([0-9]+)"></dyn_variable>
          <http url="/locations" method="POST" version="1.1" contents="location[name]=UCSB%%_num%%&amp;location[city]=Santa Barbara&amp;location[capacity]=
          100&amp;location[email]=ucsb%%_num%%@test.com&amp;location[phone]=1234567890&amp;commit=Create Location"
            content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>

      <transaction name="CREATE_TAG">
        <request subst="true">
          <dyn_variable name="tagid" re="Location: .*/tags/([0-9]+)"></dyn_variable>
          <http url="/tags" method="POST" version="1.1" contents="tag[name]=fun-event%%_num%%&amp;tag[description]=This is a fun event&amp;
          commit=Create Tag" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
      
      <thinktime value="%%_userdelay%%" random="false"/>
      
      <transaction name="CREATE_EVENT">
        <request subst="true">
          <http url="/events" method="POST" version="1.1" contents="event[title]=Goblet of Fire%%_num%%&amp;event[tag_id]=%%_tagid%%&amp;
          event[location_id]=%%_locationid%%&amp;event[price]=20&amp;event[date(1i)]=2019&amp;event[date(2i)]=1&amp;event[date(3i)]=9&amp;event[date(4i)]=05&amp;
          event[date(5i)]=09&amp;event[user_id]=%%_userid%%&amp;commit=Create Event"
            content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
  
      <transaction name="LOGOUT">
        <request subst="true">
          <http url="/logout" method="DELETE" version="1.1" content_type="application/x-www-form-urlencoded" />
        </request>
      </transaction>
    </session>
    
  </sessions>
</tsung>